In [2]:
import pandas as pd

# Missing data

For numeric data, pandas uses the floating-point value NaN (Not a Number) to represent missing data. We call this a sentinel value that can be easily detected:

In [2]:
string_data = pd.Series(['aardvark' ,'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

The built-in Python None value is also treated as NA in object arrays:

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

![na_methods](https://github.com/Zlisu/Notes/blob/master/Images/NumPy/na_methods.PNG?raw=True)

## filtering out missing data


### series
.dropna() returns the Series with only the non-null data and index values:

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

### data frame
.dropna() by default drops any row containing a missing value:

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [12]:
cleaned = data.dropna()

In [13]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned

     0    1    2
0  1.0  6.5  3.0

Passing how='all' will only drop rows that are all NA:

In [15]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

To drop columns in the same way, pass axis=1:

In [16]:
data[4] = NA

In [17]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [18]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

Suppose you want to keep only rows containing a certain number of observations. You can
indicate this with the thresh argument:

In [19]:
df = pd.DataFrame(np.random.randn(7, 3))

In [22]:
df.iloc[:4, 1] = NA

In [23]:
df.iloc[:2, 2] = NA

In [24]:
df

          0         1         2
0  0.063101       NaN       NaN
1  0.147086       NaN       NaN
2  0.574172       NaN -0.925233
3  0.725631       NaN -0.794804
4 -0.478607  0.666046  1.032444
5 -1.077313  0.015526  0.045344
6  1.915629  0.837090 -0.987991

In [25]:
df.dropna()

          0         1         2
4 -0.478607  0.666046  1.032444
5 -1.077313  0.015526  0.045344
6  1.915629  0.837090 -0.987991

In [27]:
df.dropna(thresh=2)

          0         1         2
2  0.574172       NaN -0.925233
3  0.725631       NaN -0.794804
4 -0.478607  0.666046  1.032444
5 -1.077313  0.015526  0.045344
6  1.915629  0.837090 -0.987991

## filling in missing data

Calling fillna with a constant replaces missing values with that value:

In [28]:
df.fillna(0)

          0         1         2
0  0.063101  0.000000  0.000000
1  0.147086  0.000000  0.000000
2  0.574172  0.000000 -0.925233
3  0.725631  0.000000 -0.794804
4 -0.478607  0.666046  1.032444
5 -1.077313  0.015526  0.045344
6  1.915629  0.837090 -0.987991

Calling fillna with a dict, you can use a different fill value for each column:

In [29]:
df.fillna({1:0.5, 2:0})

          0         1         2
0  0.063101  0.500000  0.000000
1  0.147086  0.500000  0.000000
2  0.574172  0.500000 -0.925233
3  0.725631  0.500000 -0.794804
4 -0.478607  0.666046  1.032444
5 -1.077313  0.015526  0.045344
6  1.915629  0.837090 -0.987991

fillna returns a new object, but you can modify the existing object in-place:

In [30]:
_ = df.fillna(0, inplace=True)

In [31]:
df

          0         1         2
0  0.063101  0.000000  0.000000
1  0.147086  0.000000  0.000000
2  0.574172  0.000000 -0.925233
3  0.725631  0.000000 -0.794804
4 -0.478607  0.666046  1.032444
5 -1.077313  0.015526  0.045344
6  1.915629  0.837090 -0.987991

The same interpolation methods available for reindexing can be used with fillna:

In [32]:
df = pd.DataFrame(np.random.randn(6, 3))

In [33]:
df.iloc[2:, 1] = NA

In [34]:
df.iloc[4:, 2] = NA

In [35]:
df

          0         1         2
0 -1.397676  0.059667  0.004562
1 -0.570001 -0.815001 -0.128779
2  0.021980       NaN  0.836397
3 -0.039814       NaN -0.885223
4  0.551251       NaN       NaN
5 -1.226454       NaN       NaN

In [36]:
df.fillna(method='ffill')

          0         1         2
0 -1.397676  0.059667  0.004562
1 -0.570001 -0.815001 -0.128779
2  0.021980 -0.815001  0.836397
3 -0.039814 -0.815001 -0.885223
4  0.551251 -0.815001 -0.885223
5 -1.226454 -0.815001 -0.885223

In [37]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.397676  0.059667  0.004562
1 -0.570001 -0.815001 -0.128779
2  0.021980 -0.815001  0.836397
3 -0.039814 -0.815001 -0.885223
4  0.551251       NaN -0.885223
5 -1.226454       NaN -0.885223

you
might pass the mean or median value of a Series:

In [39]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [40]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [41]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

![fillna](https://github.com/Zlisu/Notes/blob/master/Images/NumPy/fillna.PNG?raw=True)

# Data transformation

## removing duplicates

In [45]:
data = pd.DataFrame({'k1':['one', 'two'] * 3 + ['two'],
                     'k2':[1, 1, 2, 3, 3, 4, 4]})

In [46]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [48]:
# The DataFrame method duplicated returns a boolean Series indicating 
# whether each row is a duplicate (has been observed in a previous row) or not

data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [49]:
# drop_duplicates returns a DataFrame 
# where the duplicated array is False:

data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

Both of these methods by default consider all of the columns; alternatively, you can specify any subset of them to detect duplicates.

In [50]:
data['v1'] = range(7)

In [51]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [52]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [53]:
# 保留重复的 row 中的最后一个

data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## function or mapping

In [54]:
data = pd.DataFrame({'food': [ 'bacon', 'pulled pork', 'bacon',
                               'Pastrami', 'corned beef', 'Bacon',
                               'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4,3,12,6,7.5,8,3,5,6]})

In [55]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

Suppose you wanted to add a column indicating the type of animal that each food came from. Let’s write down a mapping of each distinct meat type to the kind of animal:

In [61]:
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [62]:
# covert to lower case

lowercased = data['food'].str.lower()

In [63]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [64]:
data['animal'] = lowercased.map(meat_to_animal)

In [65]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

We could also have passed a function that does all the work:

In [66]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## replacing values

In [3]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [4]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [5]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [6]:
# replace -999 with nan 
# and replace -1000 with 0

data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [8]:
# The argument passed can also be a dict:

data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## renaming Axis Indexes

In [11]:
data = pd.DataFrame(np.arange(12).reshape(3, 4),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [12]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [24]:
transform = lambda x:x[:4].upper()
transform

In [18]:
# Like a Series, the axis indexes have a map method:

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [16]:
data.index = data.index.map(transform)

In [17]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

If you want to create a transformed version of a dataset without modifying the original, a useful method is rename:

In [20]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [21]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

rename can be used in conjunction with a dict-like object providing new values
for a subset of the axis labels:

In [22]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

Should you wish to modify a dataset in-place, pass inplace=True:

In [23]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

## discretization and binning

### .cut()

In [26]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [27]:
bins = [18, 25, 35, 60, 100]

In [28]:
cats = pd.cut(ages, bins)

In [29]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

internally it contains a categories array specifying the distinct
category names along with a labeling for the ages data in the codes attribute:

In [30]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [31]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [32]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [33]:
## 设为不包含区间的上限
## <= 改为 <

pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

You can also pass your own bin names by passing a list or array to the labels option:

In [36]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [37]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

If you pass an integer number of bins to cut instead of explicit bin edges, it will compute equal-length bins based on the minimum and maximum values in the data.

In [38]:
data = np.random.rand(20)

In [39]:
pd.cut(data, 4, precision=2)

[(0.32, 0.53], (0.75, 0.96], (0.53, 0.75], (0.75, 0.96], (0.75, 0.96], ..., (0.11, 0.32], (0.11, 0.32], (0.11, 0.32], (0.11, 0.32], (0.75, 0.96]]
Length: 20
Categories (4, interval[float64]): [(0.11, 0.32] < (0.32, 0.53] < (0.53, 0.75] < (0.75, 0.96]]

### .qcut()

In [41]:
# qcut, bins the data based on sample quantiles.

data = np.random.randn(1000)
cats = pd.qcut(data, 4)    # Cut into quartiles

In [42]:
cats

[(-0.699, -0.00176], (0.683, 3.332], (-3.04, -0.699], (-0.699, -0.00176], (-3.04, -0.699], ..., (-0.00176, 0.683], (-0.699, -0.00176], (0.683, 3.332], (-0.00176, 0.683], (0.683, 3.332]]
Length: 1000
Categories (4, interval[float64]): [(-3.04, -0.699] < (-0.699, -0.00176] < (-0.00176, 0.683] < (0.683, 3.332]]

In [43]:
pd.value_counts(cats)

(0.683, 3.332]        250
(-0.00176, 0.683]     250
(-0.699, -0.00176]    250
(-3.04, -0.699]       250
dtype: int64

In [44]:
# Similar to cut you can pass your own quantiles 
# (numbers between 0 and 1, inclusive):

pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.3, -0.00176], (-0.00176, 1.218], (-1.3, -0.00176], (-1.3, -0.00176], (-1.3, -0.00176], ..., (-0.00176, 1.218], (-1.3, -0.00176], (-0.00176, 1.218], (-0.00176, 1.218], (1.218, 3.332]]
Length: 1000
Categories (4, interval[float64]): [(-3.04, -1.3] < (-1.3, -0.00176] < (-0.00176, 1.218] < (1.218, 3.332]]

## Outliers

In [45]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [46]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.016431    -0.016635    -0.003275     0.023701
std       0.996773     0.998516     0.975588     1.001969
min      -3.271007    -3.353231    -3.779156    -2.825434
25%      -0.678299    -0.707395    -0.653042    -0.662015
50%       0.059751    -0.049790    -0.049085     0.016920
75%       0.670617     0.645021     0.656632     0.712174
max       3.427794     3.904620     2.962018     3.427297

In [47]:
# find values in one of the columns exceeding 3 in absolute value:

col = data[2]
col[np.abs(col) > 3]

218   -3.779156
949   -3.498878
Name: 2, dtype: float64

In [51]:
# select all rows having a value exceeding 3 or –3

data[(np.abs(data) > 3).any(1)]

            0         1         2         3
36   3.427794  1.562569 -0.167054 -1.187996
91   3.327899  0.370840 -0.266134  1.439232
218 -0.439341 -0.125305 -3.779156  0.389652
222  3.271450  0.940335 -0.250923  0.150843
246 -1.098849 -0.515243  1.127730  3.115571
353 -1.447647  3.904620 -0.809020 -0.271439
438 -2.299578  0.754769 -1.028241  3.427297
538 -0.271966  3.105540  0.175523 -0.197452
736  0.258814 -3.353231 -0.003696 -2.535071
849 -3.271007  0.469351  2.079932 -0.340948
890  0.162053 -3.064681 -0.701119  1.366413
949 -0.318103 -0.517470 -3.498878  0.379568

Values can be set based on these criteria. Here is code to cap values outside the interval –3 to 3:

In [52]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [53]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.015674    -0.017227    -0.001997     0.023158
std       0.992646     0.993719     0.971208     1.000255
min      -3.000000    -3.000000    -3.000000    -2.825434
25%      -0.678299    -0.707395    -0.653042    -0.662015
50%       0.059751    -0.049790    -0.049085     0.016920
75%       0.670617     0.645021     0.656632     0.712174
max       3.000000     3.000000     2.962018     3.000000

The statement np.sign(data) produces 1 and –1 values based on whether the values
in data are positive or negative:

In [54]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0 -1.0
1  1.0  1.0 -1.0 -1.0
2 -1.0 -1.0 -1.0 -1.0
3 -1.0 -1.0 -1.0 -1.0
4 -1.0  1.0 -1.0  1.0

## Permutation and Random Sampling

Permuting means randomly reording.

Calling permutation with the length of the axis you want to permute produces an array of integers indicating the new ordering:

In [55]:
df = pd.DataFrame(np.arange(5*4).reshape((5, 4)))

In [57]:
sampler = np.random.permutation(5)

In [58]:
sampler

array([4, 0, 3, 1, 2])

In [56]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [59]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11

In [61]:
# select a random subset without replacement

df.sample(n=3)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11

In [64]:
# generate a sample with replacement (allowing repeat choices)

choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

3    6
4    4
3    6
1    7
2   -1
4    4
4    4
3    6
2   -1
4    4
dtype: int64

## Computing Indicator/Dummy Variables

### dummy matrix

In [3]:
df= pd.DataFrame({'key':['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1': range(6)})

In [4]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [5]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [6]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [7]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [10]:
df_with_dummy = df[['data1']].join(dummies) # combine data1 with the dummy matrix

In [9]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [11]:
### row in multiple categories

In [12]:
mnames = ['movie_id' ,'title', 'genres']

In [14]:
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)

C:\Users\hwny-yangkp\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead.

C:\Users\hwny-yangkp\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

In [16]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [17]:
all_genres = []

In [18]:
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)

In [19]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [20]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [21]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [22]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
5,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
6,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
7,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
8,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
9,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
10,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
11,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
12,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
13,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
14,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
15,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
16,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
17,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
18,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
19,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
20,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
21,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
22,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
23,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
24,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
25,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
26,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
27,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
28,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
29,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3853,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3854,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3855,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3856,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3857,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3858,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3859,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3860,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3861,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3862,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3863,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3864,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3865,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3866,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3867,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3868,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3869,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3870,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3871,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3872,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3873,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3874,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3875,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3876,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3877,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [23]:
# iterate through each movie and set entries in each row of dummies to 1.
# To do this, we use the dummies.columns to compute the column indices 
# for each genre:

gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [24]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [25]:
# Then, we can use .iloc to set values based on these indices:

for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [27]:
# Then, as before, you can combine this with movies:

movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [28]:
np.random.seed(12345)

In [29]:
values = np.random.rand(10)

In [30]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [31]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [32]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0